---
kind: method
id: M:Autodesk.Revit.DB.FabricationPart.GetTransform
source: html/c22a17df-8768-c2e8-942c-9e5689e6122c.htm
---
# Autodesk.Revit.DB.FabricationPart.GetTransform Method

Gets the transformation matrix of the fabrication part element.

## Syntax (C#)
```csharp
public Transform GetTransform()
```

## Returns
The transformation matrix of the fabrication part element.